export default {
    'components': {
        'common': {
            'navbar': {
                'menu': {
                    'title': 'القائمة'
                },
            },
            'footer': {
                'section': {
                    'socialMedia': {
                        'title': 'وسائل التواصل الاجتماعي',
                        'links': {
                            'github': 'غيت هاب',
                            'behance': 'بيهانس',
                            'twitter': 'إكس',
                            'linkedin': 'لينكد إن',
                            'instagram': 'إنستغرام'
                        }
                    },
                    'office': {
                        'title': 'مكتبنا:',
                        'address': '6919 شارع الأمير تركي، الكورنيش، المكتب #301، الخبر 34413',
                        'phone': '0558412255'
                    },
                    'links': {
                        'serviceStatus': 'حالة الخدمة',
                        'about': 'حول الموقع',
                        'contact': 'تواصل معنا',
                        'docs': 'الوثائق'
                    },
                    'copyright': {
                        'text': 'جميع الحقوق محفوظة © لـ شركة الدرجات الست  2024.'
                    }
                }
            },
            'menu': {
                'section': {
                    'menu': {
                        'home': 'الرئيسية',
                        'about': 'حول',
                        'contact': 'اتصل بنا'
                    },
                    'contactInfo': {
                        'headQuarter': {
                            'title': 'المقر الرئيسي',
                            'address': '6919 شارع الأمير تركي، الكورنيش، المكتب #301، الخبر 34413'
                        },
                        'howToConnect': {
                            'title': 'كيفية الاتصال',
                            'phone': '+966 55 841 2255',
                        },
                        'joinUs': {
                            'title': 'انضم إلينا',
                            'socialMedia': {
                                'github': 'غيت هب',
                                'behance': 'بيهانس',
                                'facebook': 'فيس بوك',
                                'twitter': 'إكس',
                                'linkedin': 'لينكد إن',
                                'instagram': 'إنستغرام'
                            }
                        }
                    }
                }
            }
        },
        'landing': {
            'header': {
                'title': 'ربط المستقبل',
                'subtitle': 'ابتكار المشهد الرقمي في المملكة العربية السعودية',
            },
            'about': {
                'section': {
                    'subtitle': ' - من نحن',
                    'intro': {
                        'line1': 'ممكن أعمال تكنولوجيا المعلومات وشريك',
                        'line2': 'نسعى لأن نكون الرابط بينك',
                        'line3': 'وأهدافك التكنولوجية'
                    },
                    'services': {
                        'design': {
                            'number': '01',
                            'title': 'تصميم',
                            'subtitle': 'تصميم واجهات المستخدم وتجربة المستخدم',
                            'link': 'عرض التفاصيل'
                        },
                        'development': {
                            'number': '02',
                            'title': 'تطوير',
                            'subtitle': 'تطوير المواقع الإلكترونية',
                            'link': 'عرض التفاصيل'
                        },
                        'iot': {
                            'number': '03',
                            'title': 'إنترنت الأشياء',
                            'subtitle': 'أتمتة المباني الذكية',
                            'link': 'عرض التفاصيل'
                        }
                    }
                }
            },
            'features': {
                'section': {
                    'title': 'لماذا الدرجات الست',
                    'allFeatures': 'جميع الميزات',
                }
            },
            'technologies': {
                'section': {
                    'title': 'مجموعة تقنياتنا',
                    'subtitle': 'الأفضل في الصناعة بأحدث الحلول والتقنيات',
                }
            },
            'blogs': {
                'section': {
                    'title': 'مميزاتنا',
                    'subtitle': 'أبرز النقاط',
                }
            },
            'contacts': {
                'section': {
                    'title': '- تواصل معنا',
                    'heading': 'اتصل بـ <span class="f-ultra-light">لمسة</span>.',
                    'contactForm': {
                        'title': 'نموذج الاتصال'
                    },
                    'phone': {
                        'title': 'رقم التواصل',
                        'heading':"أو ببساطة استخدم ما يلي",
                        'numbers': {
                            'primary': '+966 55 841 2255',

                        }
                    },
                    'email': {
                        'title': 'البريد الإلكتروني',
                    },
                    'address': {
                        'title': 'العنوان',
                        'details': '6919 شارع الأمير تركي، الكورنيش,<br>الخبر، المنطقة الشرقية 34413,<br>المملكة العربية السعودية',
                        'map': 'موقع على خرائط جوجل'
                    }
                }
            }
        },
        'about': {
            'header': {
                'section': {
                    'title': 'معلومات عنا',
                    'subtitle': 'الدرجات الست',
                    'image': {
                        'altText': 'نبذة عنا'
                    }
                }
            },
            'intro': {
                'section': {
                    'whoWeAre': {
                        'subtitle': 'من نحن؟',
                        'description': 'في شركة الدرجات الست لتقنية المعلومات، نؤمن بقوة الروابط. مستوحين من النظرية التي تقول بأن كل شخص في العالم مرتبط بآخر من خلال ست درجات من الانفصال فقط، نرى أنفسنا الرابط الأساسي بين عملك وهدفك التقني. سواء كنت شركة ناشئة أو مؤسسة راسخة، نحن هنا لنوفر لك حلول تقنية المعلومات المبتكرة والمصممة خصيصًا لتلبية احتياجاتك الفريدة. ',
                        'text': 'ممكن الأعمال التقنية وشريك'
                    },
                    'services': {
                        'customSoftwareDevelopment': 'تطوير البرمجيات المخصصة',
                        'mobileAppDevelopment': 'تطوير تطبيقات الجوال',
                        'websiteDevelopment': 'تطوير المواقع',
                        'uiUxDesign': 'تصميم واجهة المستخدم وتجربة المستخدم',
                        'iotSmartBuildingAutomation': 'إنترنت الأشياء وأتمتة المباني الذكية',
                        'cloudSolutions': 'الحلول السحابية',
                        'itOperationsSupport': 'دعم العمليات التقنية',
                        'businessIntelligenceDataAnalytics': 'ذكاء الأعمال وتحليل البيانات',
                        'thirdPartyIntegration': 'تكامل الطرف الثالث',
                        'seoDigitalMarketing': 'تحسين محركات البحث والتسويق الرقمي',
                        'itConsultingStrategy': 'استشارات تقنية المعلومات والاستراتيجيات'
                    },
                    'numbers': {
                        'years': '+25',
                        'yearsOfExperience': ' سنوات من الخبرة',
                        'completed': '+300',
                        'completedProjects': ' مشاريع مكتملة',
                        'clients': '+200',
                      'satisfiedClients': ' عملاء راضون'
                    }
                }
            }
        },
        'contact': {
            'header': {
                'section': {
                    'title': 'تواصل معنا.',
                    'subtitle': 'مرحباً، دعنا نتواصل',
                    'map': {
                        'label': 'خريطة الموقع'
                    }
                }
            },
            'info': {
                'section': {
                    'title': 'تواصل معنا!',
                    'subtitle': 'معلومات الاتصال',
                    'email': {
                        'label': 'البريد الإلكتروني'
                    },
                    'headQuarter': {
                        'label': 'المقر الرئيسي',
                        'address': '6919 طريق الأمير تركي، كورنيش الخبر، مكتب #301، الخبر 34413'
                    },
                    'phone': {
                        'label': 'الهاتف',
                        'number': '+966 55 841 2255'
                    }
                }
            }
        },
        'project1': {
            'section': {
                'header': {
                    'title': 'ساتورب - تطبيق الويب لليوم العالمي للسلامة',
                    'description': 'تم تطوير تطبيق ويب لـ SATORP لإدارة الفعاليات، وتتبع مشاركة الحضور، وجمع ملاحظات الزوار الفورية، مما يسهم في تبسيط العمليات وتحسين الكفاءة في إدارة الفعاليات.',
'info': {
    'first': {
        'label': 'العميل :',
        'desc': 'SATORP'
    },
    'second': {
        'label': 'الخدمة المقدمة :',
        'desc': 'تطوير تطبيق ويب'
    },
    'third': {
        'label': 'التاريخ :',
        'desc': '٥ أكتوبر ٢٠٢٢'
    },
    'fourth': {
        'label': 'الصناعة :',
        'desc': 'النفط والغاز / الفعاليات المؤسسية'
    }
}

                },
     'top_content': {
    'title': 'التحدي',
    'subtitle': 'احتاجت SATORP إلى حل قوي وسهل الاستخدام لإدارة تعقيدات الفعاليات الكبيرة.',
    'description': 'كان التحدي يتمثل في إنشاء منصة يمكنها التعامل بسلاسة مع تنسيق العديد من أجنحة الفعاليات، إدارة البيانات في الوقت الفعلي من عدد كبير من الحضور والشركات المشاركة، وتسهيل جمع الملاحظات الفورية من الزوار - وكل ذلك ضمن إطار زمني ضيق.'
},
'bottom_content': {
    'title': 'الحل',
    'subtitle': 'تبسيط عمليات الفعاليات لـ SATORP',
    'description': 'تم توفير حل يتمثل في تطبيق ويب قوي وسهل الاستخدام يتضمن لوحة تحكم مركزية لإدارة الفعالية في الوقت الفعلي. شمل أدوات لتتبع مشاركة الحضور، إدارة أجنحة الفعاليات، وجمع الملاحظات الفورية من الزوار. هذا النظام المتكامل مكّن SATORP من الإشراف بكفاءة على الفعالية، إجراء التعديلات الفورية، وضمان تجربة سلسة لجميع المشاركين.'
}

            }
        },
        'project2': {
           'section': {
    'header': {
        'title': 'المعجل للضيافة',
        'description': 'احتاجت المعجل للضيافة إلى موقع ديناميكي لتعزيز حضورهم على الإنترنت وتحسين تفاعل المستخدمين. الهدف كان تطوير منصة تسمح بتحديث المحتوى بسهولة من خلال لوحة تحكم إدارية سهلة الاستخدام، مع تنفيذ أفضل ممارسات تحسين محركات البحث (SEO) لتعزيز الظهور في محركات البحث.',
        'info': {
            'first': {
                'label': 'العميل:',
                'desc': 'المعجل للضيافة'
            },
            'second': {
                'label': 'الخدمة المقدمة:',
                'desc': 'تصميم وتطوير الويب، تحسين محركات البحث'
            },
            'third': {
                'label': 'التاريخ:',
                'desc': '29 ديسمبر 2023'
            },
            'fourth': {
                'label': 'الصناعة:',
                'desc': 'الضيافة'
            }
        }
    },
    'challenge': {
        'title': 'التحدي',
        'goal': "كانت التحديات الرئيسية في هذا المشروع تشمل الترتيب المنخفض للموقع الحالي في محركات البحث، مما أدى إلى انخفاض الظهور والزيارات العضوية.",
        'description': "بالإضافة إلى ذلك، كان نظام إدارة المحتوى الخاص بالموقع معقدًا ويحتاج إلى مساعدة فنية للتحديثات، مما جعل من الصعب على العميل إدارة المحتوى بكفاءة. وأخيرًا، أدى نقص العناصر البصرية الجذابة إلى تجربة مستخدم أقل جاذبية، مما خيب توقعات عملاء المعجل للضيافة الراقيين. تطلبت هذه التحديات إعادة تصميم شاملة لتحسين الوظائف والجاذبية البصرية."
    },
    'bottom_content': {
        'story': {
            'title': 'القصة',
            'description': 'المعجل للضيافة، وهي شركة رائدة في صناعة الضيافة، احتاجت إلى موقع يعكس أناقة علامتها التجارية ويخدم عملائها الفاخرين، بما في ذلك العملاء المميزين، وعشاق الطعام، والمسافرين الفاخرين. كان الموقع الحالي ليس فقط صعب التحديث، ولكنه فشل أيضًا في تقديم تجربة بصرية جذابة، وهو أمر أساسي لجذب جمهورهم المتطلب. كان الهدف واضحًا: إنشاء موقع لا يعرض عروضهم فقط بل يعزز تجربة المستخدم ويحسن ترتيبهم في محركات البحث.'
        },
        'approach': {
            'title': 'النهج',
            'description': 'لمواجهة هذه التحديات، اعتمد الفريق نهجًا تصميميًا يركز على المستخدم. تم بناء الموقع الجديد مع التركيز على الثيم الفاتح الذي يتماشى مع هوية المعجل للضيافة الراقية. تضمنت العناصر الرئيسية للتصميم أقسام بارزة وصور كاملة العرض لتعزيز الجاذبية البصرية. كما تم تجهيز الموقع بنظام إدارة محتوى (CMS) يسمح بتحديثات سهلة دون الحاجة إلى مساعدة فنية. بالإضافة إلى ذلك، تم تنفيذ استراتيجيات تحسين محركات البحث (SEO) لزيادة الحركة العضوية، مما يعزز من الظهور وتفاعل المستخدمين. هذا النهج ضمن أن المنتج النهائي كان مبهرًا بصريًا وقويًا من الناحية الوظيفية، مما يعكس التزام العلامة التجارية بالجودة والأناقة.'
        }
    }
}

        },
        'project3': {
 'section': {
    'header': {
        'title': 'Penpal'
    },
    'top_content': {
        'item1': {
            'label': 'اسم المشروع:',
            'description': 'منصة Penpal'
        },
        'item2': {
            'label': 'الخدمة المقدمة:',
            'description': 'تطوير تطبيق جوال، تطوير تطبيق ويب، تصميم واجهة المستخدم وتجربة المستخدم (UI/UX)'
        },
        'item3': {
            'label': 'التاريخ:',
            'description': '٠٣ سبتمبر ٢٠٢٤'
        },
        'item4': {
            'label': 'الصناعة:',
            'description': 'التعليم، البيع بالتجزئة، تفاعل المجتمع'
        },
        'challengeTitle': ' التحدي',
        'challengeSubtitle': 'واجه مشروع Penpal تحدي إنشاء منصة تجذب الطلاب الجامعيين بفعالية وتربطهم بالأعمال المحلية',
        'challengeDescription': 'كان من الضروري تصميم تطبيقين مميزين—واحد للطلاب وآخر للأعمال التجارية—مع الحفاظ على تجربة مستخدم سلسة وسهلة الاستخدام عبر كلا النظامين. بالإضافة إلى ذلك، تطلب المشروع تطوير لوحة تحكم إدارية قوية تمكن من الإدارة المركزية، والتحكم في المحتوى، وتوفير تحليلات وتقارير مفصلة، لضمان إدارة المنصة بكفاءة وتحسينها باستمرار.'
    },
    'bottom_content': {
        'title': ' الحل',
        'content': 'كانت الأهداف الأساسية لمشروع Penpal هي تطوير منصة تركز على المستخدمين، مما يجعلها بديهية وجذابة للطلاب الجامعيين. كما سعى المشروع إلى تعزيز الأعمال المحلية من خلال تقوية الروابط مع الطلاب، مما يمكن هذه الأعمال من تقديم خصومات حصرية. هدف رئيسي آخر كان توفير وفورات كبيرة للطلاب من خلال العروض التي يمكن الوصول إليها بسهولة. علاوة على ذلك، سعى المشروع إلى تعزيز تفاعل المجتمع من خلال تشجيع التفاعل بين الطلاب والأعمال المحلية. وأخيرًا، كان تطوير لوحة تحكم إدارية قوية أمرًا بالغ الأهمية، مما يوفر تحكمًا مركزيًا، وتحليلات شاملة، وإدارة مبسطة للمحتوى لضمان تشغيل المنصة بكفاءة.'
    }
}

        },
        'project4': {
'section': {
    'header': {
        'title': 'الشرقية تُبدع',
        'info': {
            'first': {
                'title': 'العميل:',
                'desc': 'إثراء (مركز الملك عبدالعزيز الثقافي العالمي)'
            },
            'second': {
                'title': 'الخدمة المقدمة:',
                'desc': 'تطوير تطبيق ويب متقدم (PWA)'
            },
            'third': {
                'title': 'التاريخ:',
                'desc': '٠٣ سبتمبر ٢٠٢٤'
            },
            'fourth': {
                'title': 'الصناعة:',
                'desc': 'المجتمع والثقافة'
            }
        }
    },
    'top_content': {
        'title': ' التحدي',
        'subtitle': 'التحديات الرئيسية التي واجهها مشروع الشرقية تُبدع تمثلت في إنشاء منصة تعرض الإبداع في المنطقة الشرقية بفعالية مع زيادة التفاعل المجتمعي.',
        'description': 'تحدٍ آخر كان ضمان أن توفر المنصة سهولة الوصول للمستخدمين لاكتشاف الأحداث الإبداعية المحلية والمشاركة فيها. بالإضافة إلى ذلك، كان من الضروري تصميم مركز مركزي يعزز التعاون بين الفنانين والمصممين والمبدعين المحليين، مما يساعدهم على اكتساب الرؤية والتعاون في المشاريع.'
    },
    'bottom_content': {
        'title': ' الحل',
        'description': 'تمثل الحل في تطوير تطبيق ويب متقدم (PWA) يعمل كمركز مركزي لمبادرة الشرقية تُبدع. تم تصميم التطبيق بتوجه يركز على المستخدم، حيث يتيح للمستخدمين الوصول بسهولة إلى بيانات الأحداث، تقييمها، والحصول على معلومات تفصيلية تشمل الاتجاهات إلى مواقع الأحداث. عززت المنصة التفاعل المجتمعي من خلال توفير مساحة للفنانين والمبدعين المحليين لعرض أعمالهم، والتعاون في المشاريع، واكتساب الرؤية. هذه المنصة السهلة الاستخدام ضمنت سهولة الوصول وساهمت في زيادة ظهور المبدعين المحليين وأعمالهم.'
    }
}

        },
    },
};