export default {
    'components': {
        'common': {
            'navbar': {
                'menu': {
                    'title': 'القائمة'
                },
            },
            'footer': {
                'section': {
                    'socialMedia': {
                        'title': 'وسائل التواصل الاجتماعي',
                        'links': {
                            'github': 'GitHub',
                            'behance': 'Behance',
                            'twitter': 'X',
                            'linkedin': 'LinkedIn',
                            'instagram': 'Instagram'
                        }
                    },
                    'office': {
                        'title': 'مكتبنا:',
                        'address': 'طريق الأمير تركي، كورنيش الخبر، مكتب #301، الخبر 34413',
                        'phone': '0558412255'
                    },
                    'links': {
                        'serviceStatus': 'حالة الخدمة',
                        'about': 'من نحن',
                        'contact': 'تواصل',
                        'docs': 'وثائق'
                    },
                    'copyright': {
                        'text': 'جميع الحقوق محفوظة © شركة 6 درجات للتقنية 2024.'
                    }
                }
            },
            'menu': {
                'section': {
                    'menu': {
                        'home': 'الرئيسية',
                        'about': 'من نحن',
                        'contact': 'تواصل'
                    },
                    'contactInfo': {
                        'headQuarter': {
                            'title': 'المقر الرئيسي',
                            'address': 'طريق الأمير تركي، كورنيش الخبر، مكتب #301، الخبر 34413'
                        },
                        'howToConnect': {
                            'title': 'كيف تتواصل معنا',
                            'phone': '+966 55 841 2255',
                        },
                        'joinUs': {
                            'title': 'انضم إلينا',
                            'socialMedia': {
                                'github': 'GitHub',
                                'behance': 'Behance',
                                'facebook': 'Facebook',
                                'twitter': 'X',
                                'linkedin': 'LinkedIn',
                                'instagram': 'Instagram'
                            }
                        }
                    }
                }
            }
        },
        'landing': {
            'header': {
                'title': 'تمكين التحول الرقمي',
                'subtitle': 'من خلال الاتصالات القوية',
            },
            'about': {
                'section': {
                    'subtitle': '- من نحن',
                    'intro': {
                        'line1': 'ممكن للأعمال التقنية وشريك موثوق',
                        'line2': ' نسعى لأن نكون الرابط بينك وبين هدفك التقني',
                        'line3': 'نحن الرابط الذي يربط أعمالك بالأهداف التقنية'
                    },
                    'services': {
                        'design': {
                            'number': '01',
                            'title': 'التصميم',
                            'subtitle': 'UI/UX',
                            'link': 'عرض التفاصيل'
                        },
                        'development': {
                            'number': '02',
                            'title': 'التطوير',
                            'subtitle': 'تطوير المواقع الإلكترونية',
                            'link': 'عرض التفاصيل'
                        },
                        'iot': {
                            'number': '03',
                            'title': 'إنترنت الأشياء',
                            'subtitle': 'أتمتة المباني الذكية',
                            'link': 'عرض التفاصيل'
                        }
                    }
                }
            },
            'features': {
                'section': {
                    'title': 'لماذا الدرجات الست ',
                    'allFeatures': 'عرض المزيد',
                }
            },
            'technologies': {
                'section': {
                    'title': 'تقنياتنا',
                    'subtitle': 'الأفضل في المجال لتلبية معايير الصناعة',
                }
            },
            'blogs': {
                'section': {
                    'title': 'أبرز اعمالنا',
                    'subtitle': 'المميزة',
                }
            },
            'contacts': {
                'section': {
                    'title': '- تواصل معنا',
                    'heading': 'ابق على <span class="f-ultra-light">اتصال</span>.',
                    'contactForm': {
                        'title': 'نموذج التواصل'
                    },
                    'phone': {
                        'title': 'رقم الهاتف',
                        'heading': 'أو استخدم التالي',
                        'numbers': {
                            'primary': '+966 55 841 2255'
                        }
                    },
                    'email': {
                        'title': 'عنوان البريد الإلكتروني',
                    },
                    'address': {
                        'title': 'العنوان',
                        'details': 'طريق الأمير تركي، كورنيش الخبر،<br>الخبر، المنطقة الشرقية 34413،<br>المملكة العربية السعودية',
                        'map': 'موقع جوجل ماب'
                    }
                }
            },
        },
        'about': {
            'header': {
                'section': {
                    'title': 'من نحن',
                    'subtitle': 'الدرجات الست لتقنية المعلومات',
                    'image': {
                        'altText': 'صورة خلفية قسم من نحن'
                    }
                }
            },
            'intro': {
                'section': {
                    'whoWeAre': {
                            'subtitle': 'من نحن؟',
                            'text': 'تمكين الشركات من خلال الابتكار والاتصال',
                            'description': 'في شركة الدرجات الست لتقنية المعلومات، نؤمن بأن التكنولوجيا هي المفتاح لإطلاق الإمكانيات اللامحدودة. مستوحاة من مفهوم أن كل فرد وكل عمل متصل من خلال ست درجات من الانفصال، نضع أنفسنا الرابط الأساسي بين مؤسستك ومستقبلها التكنولوجي. مهمتنا هي تقديم حلول تقنية معلومات مبتكرة ومخصصة لتلبية احتياجاتك الفريدة، سواء كنت شركة ناشئة أو مؤسسة راسخة. بدءاً من تطوير البرمجيات المتقدمة إلى أتمتة المباني الذكية، نهدف إلى سد الفجوة بين تحديات أعمالك والحلول الرقمية المبتكرة. دعنا نساعدك على تسخير قوة التكنولوجيا لرفع مستوى عملك إلى آفاق جديدة.'   

                    },
                    'services': {
                        'customSoftwareDevelopment': 'تطوير البرمجيات المخصصة',
                        'mobileAppDevelopment': 'تطوير تطبيقات الجوال',
                        'websiteDevelopment': 'تطوير المواقع الإلكترونية',
                        'uiUxDesign': 'تصميم UI/UX',
                        'iotSmartBuildingAutomation': 'إنترنت الأشياء وأتمتة المباني الذكية',
                        'cloudSolutions': 'الحلول السحابية',
                        'itOperationsSupport': 'دعم العمليات التقنية',
                        'businessIntelligenceDataAnalytics': 'ذكاء الأعمال وتحليل البيانات',
                        'thirdPartyIntegration': 'دمج الطرف الثالث',
                        'seoDigitalMarketing': 'تحسين محركات البحث والتسويق الرقمي',
                        'itConsultingStrategy': 'الاستشارات التقنية والاستراتيجيات',
                        "erp": "حلول تخطيط موارد المؤسسات (ERP)"


                    },
                    'numbers': {
                        'years': '+25',
                        'yearsOfExperience': 'سنوات من الخبرة',
                        'completed': '+300',
                        'completedProjects': ' مشاريع مكتملة',
                        'clients': '+200',
                        'satisfiedClients': ' عملاء راضون'
                    }
                }
            }
        },
        'contact': {
            'header': {
                'section': {
                    'title': 'تواصل معنا.',
                    'subtitle': 'تجدنا بجانب الكورنيش ',
                    'map': {
                        'label': 'خريطة الموقع'
                    }
                }
            },
            'info': {
                'section': {
                    'title': 'اتصل بنا!',
                    'subtitle': 'معلومات التواصل',
                    'email': {
                        'label': 'البريد الإلكتروني',
                    },
                    'headQuarter': {
                        'label': 'المقر الرئيسي',
                        'address': 'طريق الأمير تركي، كورنيش الخبر، مكتب #301، الخبر 34413'
                    },
                    'phone': {
                        'label': 'الهاتف',
                        'number': '+966 55 841 2255'
                    }
                }
            }
        },
        'project1': {
            'section': {
                'header': {
                    'title': 'SATORP - تطبيق يوم السلامة العالمي',
                    'description': 'تم تطوير تطبيق ويب لـ SATORP لإدارة منصات الأحداث، وتتبع مشاركة الحضور، وجمع تعليقات الزوار الفورية، مما يعزز كفاءة العمليات في الحدث.',
                    'info': {
                        'first': {
                            'label': 'العميل:',
                            'desc': 'SATORP'
                        },
                        'second': {
                            'label': 'الخدمة المقدمة:',
                            'desc': 'تطوير تطبيق ويب'
                        },
                        'third': {
                            'label': 'التاريخ:',
                            'desc': '05 أكتوبر 2022'
                        },
                        'fourth': {
                            'label': 'الصناعة:',
                            'desc': 'النفط والغاز / الفعاليات'
                        }
                    }
                },
                'top_content': {
                    'title': 'التحدي',
                    'subtitle': 'طلبت SATORP حلًا قويًا وسهل الاستخدام لإدارة تعقيدات الأحداث واسعة النطاق.',
                    'description': 'كان التحدي هو إنشاء منصة يمكنها التعامل بسلاسة مع تنسيق العديد من منصات الأحداث، وإدارة البيانات في الوقت الفعلي من عدد كبير من الحضور والشركات المشاركة، وتسهيل جمع تعليقات الزوار الفورية - كل ذلك ضمن إطار زمني ضيق.'
                },
                'bottom_content': {
                    "title": "الحل",
                    "subtitle": "تبسيط عمليات الحدث لـ SATORP",
                    "description": "قدم الحل تطبيق ويب قوي وسهل الاستخدام يتميز بلوحة تحكم مركزية لإدارة الحدث في الوقت الفعلي. تضمن أدوات لتتبع مشاركة الحضور، إدارة منصات الأحداث، وجمع تعليقات الزوار الفورية. هذه المنصة المتكاملة مكنت SATORP من إدارة الحدث بكفاءة، إجراء التعديلات الفورية، وضمان تجربة سلسة لجميع المشاركين."
                },
            }
        },
        'project2': {
            'section': {
                'header': {
                    'title': 'المعجل للضيافة',
                    'description': 'احتاجت شركة المعجل للضيافة إلى موقع ويب ديناميكي لتعزيز تواجدهم عبر الإنترنت وزيادة التفاعل مع المستخدمين. كان الهدف هو تطوير منصة تسمح بتحديثات المحتوى بسهولة من خلال لوحة إدارة بديهية، مع تنفيذ أفضل ممارسات تحسين محركات البحث لتحسين ظهورهم في محركات البحث.',
                    'info': {
                        'first': {
                            'label': 'العميل:',
                            'desc': ' المعجل للضيافة '
                        },
                        'second': {
                            'label': 'الخدمة المقدمة:',
                            'desc': 'تصميم وتطوير الموقع الإلكتروني، تحسين محركات البحث'
                        },
                        'third': {
                            'label': 'التاريخ:',
                            'desc': '29 ديسمبر 2023'
                        },
                        'fourth': {
                            'label': 'الصناعة:',
                            'desc': 'الضيافة'
                        }
                    }
                },
                'challenge': {
                    'title': 'التحدي',
                    'goal': "تمثلت التحديات الرئيسية في هذا المشروع في انخفاض ترتيب الموقع الحالي في محركات البحث، مما أعاق الظهور وحركة المرور العضوية.",
                    'description': "بالإضافة إلى ذلك، كانت لوحة إدارة المحتوى الخاصة بالموقع صعبة الاستخدام، حيث كانت تتطلب المساعدة التقنية لإجراء التحديثات، مما جعل من الصعب على العميل إدارة المحتوى بكفاءة. أخيرًا، كان عدم وجود صور جذابة أقل فعالية في تجربة المستخدم، مما أدى إلى تجربة أقل جاذبية لمستخدمي الموقع. هذه التحديات استلزمت إعادة تصميم شاملة لتحسين الوظائف والجاذبية البصرية."
                },
                'bottom_content': {
                    'story': {
                        'title': 'القصة',
                        'description': 'احتاجت شركة المعجل للضيافة، وهي رائدة في صناعة الضيافة، إلى موقع إلكتروني يعكس الأناقة التي تتميز بها علامتها التجارية ويستهدف عملائها الراقيين، بما في ذلك العملاء المتميزين، عشاق الطعام والمسافرين الفاخرة. كان الموقع الحالي ليس فقط صعب التحديث ولكنه أيضًا لم يكن يوفر تجربة بصرية جذابة، مما كان ضروريًا لجذب جمهورهم المميز. كان الهدف واضحًا: إنشاء موقع إلكتروني لا يعرض فقط عروضهم بل أيضًا يعزز تجربة المستخدم ويحسن ترتيبهم في محركات البحث.'
                    },
                    'approach': {
                        'title': 'النهج',
                        'description': 'لمعالجة هذه التحديات، اعتمد الفريق نهجًا يركز على المستخدم في التصميم. تم بناء الموقع الجديد مع التركيز على موضوع خفيف يتماشى مع هوية الضيافة من المعجل الأنيقة. تضمنت العناصر التصميمية الرئيسية أقسام بارزة وصور كبيرة على كامل العرض لتعزيز الجاذبية البصرية. كما تم تجهيز الموقع بنظام إدارة محتوى (CMS) يسمح بتحديثات سهلة دون الحاجة إلى المساعدة التقنية. بالإضافة إلى ذلك، تم تنفيذ استراتيجيات تحسين محركات البحث لزيادة حركة المرور العضوية، مما يحسن من الظهور والتفاعل مع المستخدمين. هذا النهج ضمن أن المنتج النهائي كان رائعًا بصريًا وقويًا من الناحية الوظيفية، مما يعكس التزام العلامة التجارية بالجودة والأناقة.'
                    }
                },
            }
        },
        'project3': {
            'section': {
                'header': {
                    'title': 'Penpal'
                },
                'top_content': {
                    'item1': {
                        'label': 'اسم المشروع:',
                        'description': 'منصة Penpal'
                    },
                    'item2': {
                        'label': 'الخدمة المقدمة:',
                        'description': 'تطوير تطبيقات الهاتف، تطوير تطبيق ويب، تصميم UI/UX'
                    },
                    'item3': {
                        'label': 'التاريخ:',
                        'description': '03 سبتمبر 2024'
                    },
                    'item4': {
                        'label': 'الصناعة:',
                        'description': 'التعليم، التجزئة، مشاركة المجتمع'
                    },
                    'challengeTitle': 'التحدي',
                    'challengeSubtitle': 'تمثل التحدي في مشروع Penpal في إنشاء منصة تجذب الطلاب الجامعيين وتربطهم بالشركات المحلية',
                    'challengeDescription': 'كان من الضروري تصميم تطبيقين منفصلين - واحد للطلاب وواحد للشركات - مع الحفاظ على تجربة مستخدم سلسة وسهلة على كلا المنصتين. بالإضافة إلى ذلك، تطلب المشروع تنفيذ لوحة إدارة قوية قادرة على الإدارة المركزية، والتحكم في المحتوى، وتقديم تحليلات وتقرير دقيق، لضمان أنه يمكن إدارة المنصة بكفاءة وتحسينها.'
                },
                'bottom_content': {
                    'title': 'الحل',
                    'content': 'كانت الأهداف الرئيسية لمشروع Penpal تطوير منصة تركز على المستخدم وتناسب احتياجات الطلاب الجامعيين، مما يجعلها بديهية وجذابة. كما هدف المشروع إلى تعزيز الشركات المحلية من خلال خلق روابط أقوى مع الطلاب، مما يمكن هذه الشركات من تقديم خصومات حصرية. هدف آخر هو تمكين الطلاب من توفير مبالغ كبيرة من خلال العروض المتاحة بسهولة. بالإضافة إلى ذلك، سعى المشروع إلى تعزيز مشاركة المجتمع من خلال تشجيع التفاعلات بين الطلاب والشركات المحلية. وأخيرًا، كان تطوير لوحة إدارة قوية أمرًا بالغ الأهمية، مما يوفر سيطرة مركزية، وتحليلات شاملة، وإدارة محتوى سلسة لعملية تشغيل المنصة بكفاءة.'
                },
            }
        },
        'project4': {
            'section': {
                'header': {
                    'title': 'الشرقية تبدع',
                    'info': {
                        'first': {
                            'title': 'العميل:',
                            'desc': 'إثراء (مركز الملك عبدالعزيز الثقافي العالمي)'
                        },
                        'second': {
                            'title': 'الخدمة المقدمة:',
                            'desc': 'تطوير تطبيق ويب متقدم'
                        },
                        'third': {
                            'title': 'التاريخ:',
                            'desc': '01 نوفمبر 2023'
                        },
                        'fourth': {
                            'title': 'الصناعة:',
                            'desc': 'المجتمع والثقافة'
                        }
                    }
                },
                'top_content': {
                    'title': 'التحدي',
                    'subtitle': 'تمثلت التحديات الرئيسية في مشروع "الشرقية تبدع" في إنشاء منصة تعرض بشكل فعال الإبداع داخل المنطقة الشرقية مع تعزيز المشاركة المجتمعية.',
                    'description': 'كان التحدي الآخر هو ضمان أن توفر المنصة إمكانية وصول سهلة للمستخدمين لاكتشاف والمشاركة في الفعاليات الإبداعية المحلية. بالإضافة إلى ذلك، كان من الضروري تصميم مركز محوري يمكن أن يعزز التعاون بين الفنانين والمصممين والأفراد المبدعين المحليين، مما يتيح لهم اكتساب الظهور والتعاون في المشاريع.'
                },
                'bottom_content': {
                    'title': 'الحل',
                    'description': 'تم تطوير الحل من خلال تطوير تطبيق ويب متقدم (PWA) يعمل كمركز محوري لمبادرة "الشرقية تبدع". تم تصميم التطبيق باستخدام نهج يركز على المستخدم، مما يوفر منصة حيث يمكن للمستخدمين بسهولة الوصول إلى بيانات الأحداث، تقييم الفعاليات، والحصول على معلومات تفصيلية بما في ذلك الاتجاهات إلى مواقع الفعاليات. عززت المنصة المشاركة المجتمعية من خلال توفير مساحة للفنانين المحليين والمبدعين لعرض أعمالهم والتعاون في المشاريع واكتساب الظهور. كما ضمنت هذه المنصة سهلة الاستخدام إمكانية الوصول السلس، مما يساعد على زيادة الظهور للمبدعين المحليين وأعمالهم.'
                }
            }
        },
    },
};
