export default {
    'components': {
        'common': {
            'navbar': {
                'menu': {
                    'title': 'القائمة'
                },
            },
            'footer': {
                'section': {
                    'socialMedia': {
                        'title': 'وسائل التواصل الاجتماعي',
                        'links': {
                            'github': 'غيت هاب',
                            'behance': 'بيهانس',
                            'twitter': 'إكس',
                            'linkedin': 'لينكد إن',
                            'instagram': 'إنستغرام'
                        }
                    },
                    'office': {
                        'title': 'مكتبنا:',
                        'address': '6919 شارع الأمير تركي، الكورنيش، المكتب #301، الخبر 34413',
                        'phone': '0558412255'
                    },
                    'links': {
                        'serviceStatus': 'حالة الخدمة',
                        'about': 'حول الموقع',
                        'contact': 'تواصل معنا',
                        'docs': 'الوثائق'
                    },
                    'copyright': {
                        'text': 'جميع الحقوق محفوظة © لـ شركة الدرجات الست  2024.'
                    }
                }
            },
            'menu': {
                'section': {
                    'menu': {
                        'home': 'الرئيسية',
                        'about': 'حول',
                        'contact': 'اتصل بنا'
                    },
                    'contactInfo': {
                        'headQuarter': {
                            'title': 'المقر الرئيسي',
                            'address': '6919 شارع الأمير تركي، الكورنيش، المكتب #301، الخبر 34413'
                        },
                        'howToConnect': {
                            'title': 'كيفية الاتصال',
                            'phone': '+966 55 841 2255',
                        },
                        'joinUs': {
                            'title': 'انضم إلينا',
                            'socialMedia': {
                                'github': 'غيت هب',
                                'behance': 'بيهانس',
                                'facebook': 'فيس بوك',
                                'twitter': 'إكس',
                                'linkedin': 'لينكد إن',
                                'instagram': 'إنستغرام'
                            }
                        }
                    }
                }
            }
        },
        'landing': {
            'header': {
                'title': 'ربط المستقبل',
                'subtitle': 'ابتكار المشهد الرقمي في المملكة العربية السعودية',
            },
            'about': {
                'section': {
                    'subtitle': ' - من نحن',
                    'intro': {
                        'line1': 'ممكن أعمال تكنولوجيا المعلومات وشريك',
                        'line2': 'نسعى لأن نكون الرابط بينك',
                        'line3': 'وأهدافك التكنولوجية'
                    },
                    'services': {
                        'design': {
                            'number': '01',
                            'title': 'تصميم',
                            'subtitle': 'تصميم واجهات المستخدم وتجربة المستخدم',
                            'link': 'عرض التفاصيل'
                        },
                        'development': {
                            'number': '02',
                            'title': 'تطوير',
                            'subtitle': 'تطوير المواقع الإلكترونية',
                            'link': 'عرض التفاصيل'
                        },
                        'iot': {
                            'number': '03',
                            'title': 'إنترنت الأشياء',
                            'subtitle': 'أتمتة المباني الذكية',
                            'link': 'عرض التفاصيل'
                        }
                    }
                }
            },
            'features': {
                'section': {
                    'title': 'لماذا الدرجات الست',
                    'allFeatures': 'جميع الميزات',
                }
            },
            'technologies': {
                'section': {
                    'title': 'مجموعة تقنياتنا',
                    'subtitle': 'الأفضل في الصناعة بأحدث الحلول والتقنيات',
                }
            },
            'blogs': {
                'section': {
                    'title': 'مميزاتنا',
                    'subtitle': 'أبرز النقاط',
                }
            },
            'contacts': {
                'section': {
                    'title': '- تواصل معنا',
                    'heading': 'اتصل بـ <span class="f-ultra-light">لمسة</span>.',
                    'contactForm': {
                        'title': 'نموذج الاتصال'
                    },
                    'phone': {
                        'title': 'ارقام التواصل',
                        'numbers': {
                            'primary': '+966 55 841 2255',
                            'secondary': '+966 53 786 2922',
                            'note': '(للاستخدام عبر الرسائل القصيرة فقط)'
                        }
                    },
                    'email': {
                        'title': 'البريد الإلكتروني',
                    },
                    'address': {
                        'title': 'العنوان',
                        'details': '6919 شارع الأمير تركي، الكورنيش,<br>الخبر، المنطقة الشرقية 34413,<br>المملكة العربية السعودية',
                        'map': 'موقع على خرائط جوجل'
                    }
                }
            }
        },
        'about': {
            'header': {
                'section': {
                    'title': 'معلومات عنا',
                    'subtitle': 'الدرجات الست',
                    'image': {
                        'altText': 'نبذة عنا'
                    }
                }
            },
            'intro': {
                'section': {
                    'whoWeAre': {
                        'subtitle': 'من نحن؟',
                        'description': 'نحن شركة تكنولوجيا رائدة مقرها في المملكة العربية السعودية، مكرسة لدفع التحول الرقمي والابتكار عبر مختلف القطاعات. بدأت رحلتنا برؤية لجسر الفجوة بين التكنولوجيا واحتياجات الأعمال، واليوم نفخر بأن نكون شريكًا موثوقًا للعديد من الشركات في المملكة.',
                        'text': 'ممكن الأعمال التقنية وشريك'
                    },
                    'services': {
                        'uiUx': 'تصميم واجهة المستخدم وتجربة المستخدم',
                        'websiteDevelopment': 'تطوير المواقع',
                        'applicationDevelopment': 'تطوير التطبيقات',
                        'seo': 'تحسين محركات البحث (SEO)',
                        'hardwareImport': 'استيراد الأجهزة',
                        'smartBuildingAutomation': 'أتمتة المباني الذكية',
                        'apiIntegration': 'تكامل واجهات البرمجة (API)',
                        'dataMigration': 'ترحيل البيانات'
                    },
                    'numbers': {
                        'yearsOfExperience': '+25 سنوات من الخبرة',
                        'completedProjects': '+50 مشاريع مكتملة',
                        'satisfiedClients': '+200 عملاء راضون'
                    }
                }
            }
        },
        'contact': {
            'header': {
                'section': {
                    'title': 'تواصل معنا.',
                    'subtitle': 'مرحباً، دعنا نتواصل',
                    'map': {
                        'label': 'خريطة الموقع'
                    }
                }
            },
            'info': {
                'section': {
                    'title': 'تواصل معنا!',
                    'subtitle': 'معلومات الاتصال',
                    'email': {
                        'label': 'البريد الإلكتروني'
                    },
                    'headQuarter': {
                        'label': 'المقر الرئيسي',
                        'address': '6919 طريق الأمير تركي، كورنيش الخبر، مكتب #301، الخبر 34413'
                    },
                    'phone': {
                        'label': 'الهاتف',
                        'number': '+966 55 841 2255'
                    }
                }
            }
        },
        'project1': {
            'section': {
                'header': {
                    'title': 'تطبيق Penpal',
                    'description': 'هناك العديد من التعديلات على مقاطع Lorem Ipsum المتاحة، لكن الغالبية تعرضت لتغييرات من نوع ما.',
                    'info': {
                        'first': {
                            'label': 'الأول:',
                            'desc': 'وصف'
                        },
                        'second': {
                            'label': 'الثاني:',
                            'desc': 'وصف'
                        },
                        'third': {
                            'label': 'الثالث:',
                            'desc': 'وصف'
                        },
                        'fourth': {
                            'label': 'الرابع:',
                            'desc': 'وصف'
                        }
                    }
                },
                "top_content": {
                    "title": "التحدي <br />",
                    "subtitle": "توجد العديد من التعديلات على مقاطع Lorem Ipsum المتاحة، لكن الغالبية تعرضت لتغييرات من نوع ما..",
                    "description": "توجد العديد من التعديلات على مقاطع Lorem Ipsum المتاحة، لكن الغالبية تعرضت لتغييرات من نوع ما. توجد العديد من التعديلات على مقاطع Lorem Ipsum المتاحة، لكن الغالبية تعرضت لتغييرات من نوع ما.."
                },
                "bottom_content": {
                    "title": "الحل",
                    "subtitle": "توجد العديد من التعديلات على مقاطع Lorem Ipsum المتاحة، لكن الغالبية تعرضت لتغييرات من نوع ما.",
                    "description": "توجد العديد من التعديلات على مقاطع Lorem Ipsum المتاحة، لكن الغالبية تعرضت لتغييرات من نوع ما. توجد العديد من التعديلات على مقاطع Lorem Ipsum المتاحة، لكن الغالبية تعرضت لتغييرات من نوع ما."
                },
            }
        },
        'project2': {
            'section': {
                'header': {
                    'title': 'المعجل للضيافة',
                    'description': 'نحن نقدم خدمات تجربة رقمية للشركات الناشئة والصغيرة. نحن نساعد عملاءنا على النجاح من خلال إنشاء هويات العلامات التجارية.',
                    "info": {
                        "first": {
                            "label": "الأول :",
                            "desc": "الوصف"
                        },
                        "second": {
                            "label": "الثاني :",
                            "desc": "الوصف"
                        },
                        "third": {
                            "label": "الثالث :",
                            "desc": "الوصف"
                        },
                        "fourth": {
                            "label": "الرابع :",
                            "desc": "الوصف"
                        }
                    }
                },
                'challenge': {
                    'title': 'التحدي <br />',
                    'goal': "الهدف هو أن هناك العديد من الاختلافات في مقاطع نصوص لوريم إيبسوم المتاحة، ولكن الغالبية تعرضت لتغيير ما، إما بواسطة فكاهة مضافة أو كلمات عشوائية لا تبدو حتى بالكاد قابلة للتصديق.",
                    'description': "هناك العديد من الاختلافات في مقاطع نصوص لوريم إيبسوم المتاحة، ولكن الغالبية تعرضت لتغيير ما، إما بواسطة فكاهة مضافة أو كلمات عشوائية لا تبدو حتى بالكاد قابلة للتصديق. إذا كنت ستستخدم مقطعًا من نص لوريم إيبسوم، يجب أن تتأكد من أنه لا يوجد شيء محرج مخفي في وسط النص.",
                },
                'bottom_content': {
                    'story': {
                        'title': 'القصة',
                        'description': 'نقدم خدمات تجربة رقمية للشركات الناشئة والأعمال الصغيرة. نساعد عملائنا على النجاح من خلال إنشاء هويات علاماتهم التجارية، وتجارب رقمية، ومواد مطبوعة. قم بتثبيت أي نموذج تجريبي أو ملحق أو قالب في ثوانٍ. فقط اختر النموذج التجريبي واضغط على OK. الأمر بهذه السهولة! أحدث اتجاهات التصميم تلتقي بالقوالب اليدوية في مجموعة Ave. استخدم الأقسام المدمجة لتسريع عملية التصميم الخاصة بك. افتح متجرًا جميلًا، وزد من معدلات التحويل الخاصة بك، ورفع مبيعاتك في دقائق مع تجربة المستخدم الموجهة.'
                    },
                    'approach': {
                        'title': 'النهج',
                        'description': 'نقدم خدمات تجربة رقمية للشركات الناشئة والأعمال الصغيرة. نساعد عملائنا على النجاح من خلال إنشاء هويات علاماتهم التجارية، وتجارب رقمية، ومواد مطبوعة. قم بتثبيت أي نموذج تجريبي أو ملحق أو قالب في ثوانٍ. فقط اختر النموذج التجريبي واضغط على OK. الأمر بهذه السهولة! أحدث اتجاهات التصميم تلتقي بالقوالب اليدوية في مجموعة Ave. استخدم الأقسام المدمجة لتسريع عملية التصميم الخاصة بك. افتح متجرًا جميلًا، وزد من معدلات التحويل الخاصة بك، ورفع مبيعاتك في دقائق مع تجربة المستخدم الموجهة.'
                    }
                }
            },
        },
        'project3': {
            'section': {
                'header': {
                    "title": "الشرقية تبدع"
                },
                'top_content': {
                    'item1': {
                        'label': 'الأول :',
                        'description': 'وصف'
                    },
                    'item2': {
                        'label': 'الثاني :',
                        'description': 'وصف'
                    },
                    'item3': {
                        'label': 'الثالث :',
                        'description': 'وصف'
                    },
                    'item4': {
                        'label': 'الرابع :',
                        'description': 'وصف'
                    },
                    'challengeTitle': '01 . التحدي',
                    'challengeSubtitle': 'الهدف هو وجود العديد من النسخ المختلفة من نصوص Lorem Ipsum المتاحة، ولكن الغالبية منها تعرضت للتغيير بشكل ما، إما عن طريق الفكاهة المُدخلة، أو الكلمات العشوائية التي لا تبدو حتى قليلاً قابلة للتصديق.',
                    'challengeDescription': 'توجد العديد من النسخ المختلفة من نصوص Lorem Ipsum المتاحة، ولكن الغالبية منها تعرضت للتغيير بشكل ما، إما عن طريق الفكاهة المُدخلة، أو الكلمات العشوائية التي لا تبدو حتى قليلاً قابلة للتصديق. إذا كنت ستستخدم نصًا من Lorem Ipsum، تحتاج إلى التأكد من عدم وجود أي شيء محرج مخفي في وسط النص.'

                },
                'bottom_content': {
                    'title': '02 . الحل',
                    'content': "توجد العديد من النسخ المختلفة من نصوص Lorem Ipsum المتاحة، ولكن الغالبية منها تعرضت للتغيير بشكل ما، إما عن طريق الفكاهة المُدخلة، أو الكلمات العشوائية التي لا تبدو حتى قليلاً قابلة للتصديق. إذا كنت ستستخدم نصًا من Lorem Ipsum، تحتاج إلى التأكد من عدم وجود أي شيء محرج مخفي في وسط النص."
                }
            }
        },
        'project4': {
            'section': {
                'header': {
                    'title': 'كفاءة العرض',
                    'info': {
                        'first': {
                            'title': 'الأول :',
                            'desc': 'الوصف'
                        },
                        'second': {
                            'title': 'الثاني :',
                            'desc': 'الوصف'
                        },
                        'third': {
                            'title': 'الثالث :',
                            'desc': 'الوصف'
                        },
                        'fourth': {
                            'title': 'الرابع :',
                            'desc': 'الوصف'
                        }
                    }
                },
                'top_content': {
                    'title': '01 . التحدي',
                    'subtitle': 'الهدف هو أن هناك العديد من الاختلافات في مقاطع نصوص Lorem Ipsum المتاحة، ولكن الغالبية قد تعرضت لتعديل.',
                    'description': 'توجد العديد من الاختلافات في مقاطع نصوص Lorem Ipsum المتاحة، ولكن الغالبية قد تعرضت لتعديل ما، سواء بإضافة الفكاهة، أو الكلمات العشوائية التي لا تبدو حتى قليلة التصديق. إذا كنت ستستخدم مقطعاً من Lorem Ipsum، تحتاج إلى التأكد من عدم وجود أي شيء.'
                },
                'bottom_content': {
                    'title': '02 . الحل',
                    'description': 'توجد العديد من الاختلافات في مقاطع النصوص من Lorem Ipsum المتاحة، ولكن الغالبية قد تعرضت لتعديل ما، سواء بإضافة الفكاهة، أو الكلمات العشوائية التي لا تبدو حتى قليلة التصديق. إذا كنت ستستخدم مقطعاً من Lorem Ipsum، تحتاج إلى التأكد من عدم وجود أي شيء محرج مخفي في وسط النص.'
                }
            }
        },
    },
};